## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################
module.testing_postgres[0].module.credentials.random_password.password[0]: Refreshing state... [id=none]
module.teleport-agent[0].data.external.join_token: Reading...
module.externaldns[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.teleport-agent[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=teleport-agent]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.teleport-agent[0].kubernetes_cluster_role.teleport_limited[0]: Refreshing state... [id=teleport-agent-limited]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns]
module.cert_manager[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=cert-manager]
module.teleport-agent[0].data.external.join_token: Read complete after 0s [id=-]
module.teleport-agent[0].kubernetes_cluster_role.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.testing_postgres[0].module.ingress.kubernetes_ingress_v1.this[0]: Refreshing state... [id=default/postgres-postgresql-ingress]
module.externaldns[0].kubernetes_deployment.externaldns: Refreshing state... [id=external-dns/external-dns]
module.teleport-agent[0].module.helm.helm_release.this: Refreshing state... [id=teleport-agent]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-viewer]
module.testing_postgres[0].module.credentials.kubernetes_secret.this[0]: Refreshing state... [id=default/postgres-credentials]
module.teleport-agent[0].kubernetes_cluster_role_binding.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0]: Refreshing state... [id=cert-manager/cloudflare-api-token]
module.cert_manager[0].module.helm.helm_release.this: Refreshing state... [id=cert-manager]
module.testing_postgres[0].module.helm.helm_release.this: Refreshing state... [id=postgres]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.testing_postgres[0].data.vault_kv_secret_v2.existing_secret[0]: Reading...
module.testing_postgres[0].data.vault_kv_secret_v2.existing_secret[0]: Read complete after 0s [id=kv/data/cluster-secret-store/secrets/POSTGRES]
module.testing_postgres[0].vault_kv_secret_v2.postgres_password[0]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/POSTGRES]
module.external_secrets[0].kubernetes_manifest.vault_secret_store[0]: Refreshing state...
module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.cluster_secrets[0]: Refreshing state...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################
module.teleport-agent[0].data.external.join_token: Reading...
module.kubevirt_operator[0].data.http.kubevirt_operator_yaml: Reading...
module.kubevirt_operator[0].data.http.cdi_operator_yaml: Reading...
module.teleport-agent[0].data.external.join_token: Read complete after 0s [id=-]
module.teleport-agent[0].kubernetes_cluster_role.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.teleport-agent[0].kubernetes_cluster_role.teleport_limited[0]: Refreshing state... [id=teleport-agent-limited]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns]
module.cert_manager[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=cert-manager]
module.externaldns[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.longhorn[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=longhorn-system]
module.teleport-agent[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=teleport-agent]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-viewer]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0]: Refreshing state... [id=cert-manager/cloudflare-api-token]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.cert_manager[0].module.helm.helm_release.this: Refreshing state... [id=cert-manager]
module.externaldns[0].kubernetes_deployment.externaldns: Refreshing state... [id=external-dns/external-dns]
module.teleport-agent[0].kubernetes_cluster_role_binding.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.longhorn[0].module.helm.helm_release.this: Refreshing state... [id=longhorn]
module.teleport-agent[0].module.helm.helm_release.this: Refreshing state... [id=teleport-agent]
module.kubevirt_operator[0].data.http.cdi_operator_yaml: Read complete after 1s [id=https://github.com/kubevirt/containerized-data-importer/releases/download/v1.62.0/cdi-operator.yaml]
module.kubevirt_operator[0].data.http.kubevirt_operator_yaml: Read complete after 1s [id=https://github.com/kubevirt/kubevirt/releases/download/v1.5.1/kubevirt-operator.yaml]
module.kubevirt_operator[0].data.kubectl_file_documents.cdi_operator_yaml: Reading...
module.kubevirt_operator[0].data.kubectl_file_documents.kubevirt_operator_yaml: Reading...
module.kubevirt_operator[0].data.kubectl_file_documents.cdi_operator_yaml: Read complete after 0s [id=c1c11ac41fa38c9cca2962c0955e1b5b6fa75cb225268eb8a724ffffd0b22622]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/api/v1/namespaces/cdi/serviceaccounts/cdi-operator"]: Refreshing state... [id=/api/v1/namespaces/cdi/serviceaccounts/cdi-operator]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cdi-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cdi-operator]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/rbac.authorization.k8s.io/v1/namespaces/cdi/roles/cdi-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/cdi/roles/cdi-operator]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/rbac.authorization.k8s.io/v1/clusterroles/cdi-operator-cluster"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cdi-operator-cluster]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apps/v1/namespaces/cdi/deployments/cdi-operator"]: Refreshing state... [id=/apis/apps/v1/namespaces/cdi/deployments/cdi-operator]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/rbac.authorization.k8s.io/v1/namespaces/cdi/rolebindings/cdi-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/cdi/rolebindings/cdi-operator]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/api/v1/namespaces/cdi"]: Refreshing state... [id=/api/v1/namespaces/cdi]
module.kubevirt_operator[0].data.kubectl_file_documents.kubevirt_operator_yaml: Read complete after 0s [id=b666235eaa930fe14d8c8af218d8133e1be6184b16d1b05554eb03cb9dd02f91]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/rbac.authorization.k8s.io/v1/namespaces/kubevirt/rolebindings/kubevirt-operator-rolebinding"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubevirt/rolebindings/kubevirt-operator-rolebinding]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/apps/v1/namespaces/kubevirt/deployments/virt-operator"]: Refreshing state... [id=/apis/apps/v1/namespaces/kubevirt/deployments/virt-operator]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/rbac.authorization.k8s.io/v1/namespaces/kubevirt/roles/kubevirt-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubevirt/roles/kubevirt-operator]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/api/v1/namespaces/kubevirt/serviceaccounts/kubevirt-operator"]: Refreshing state... [id=/api/v1/namespaces/kubevirt/serviceaccounts/kubevirt-operator]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/rbac.authorization.k8s.io/v1/clusterroles/kubevirt-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubevirt-operator]
module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/api/v1/namespaces/kubevirt"]: Refreshing state... [id=/api/v1/namespaces/kubevirt]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/rbac.authorization.k8s.io/v1/clusterroles/kubevirt.io:operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubevirt.io:operator]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/scheduling.k8s.io/v1/priorityclasses/kubevirt-cluster-critical"]: Refreshing state... [id=/apis/scheduling.k8s.io/v1/priorityclasses/kubevirt-cluster-critical]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubevirt-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubevirt-operator]
module.kubevirt_operator[0].kubectl_manifest.kubevirt_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kubevirts.kubevirt.io"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kubevirts.kubevirt.io]
module.kubevirt[0].kubectl_manifest.kubevirt_cr[0]: Refreshing state... [id=/apis/kubevirt.io/v1/namespaces/kubevirt/kubevirts/kubevirt]
module.kubevirt[0].kubectl_manifest.cdi_cr[0]: Refreshing state... [id=/apis/cdi.kubevirt.io/v1beta1/cdis/cdi]
module.kubevirt[0].module.cdi_ingress[0].kubernetes_ingress_v1.this[0]: Refreshing state... [id=cdi/cdi-uploadproxy-ingress]
module.kubevirt[0].module.export_ingress[0].kubernetes_ingress_v1.this[0]: Refreshing state... [id=kubevirt/virt-exportproxy-ingress]
module.external_secrets[0].kubernetes_manifest.vault_secret_store[0]: Refreshing state...
module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.cluster_secrets[0]: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: sandboxy.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "sandboxy.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################
module.teleport-agent[0].data.external.join_token: Reading...
module.harbor[0].vault_kv_secret_v2.harbor_database: Refreshing state... [id=kv/data/cluster-secret-store/secrets/HARBOR_DB]
module.harbor[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=harbor]
module.postgres[0].module.credentials.random_password.password[0]: Refreshing state... [id=none]
module.redis[0].module.credentials.random_password.password[0]: Refreshing state... [id=none]
module.nats[0].module.credentials.random_password.password[0]: Refreshing state... [id=none]
module.teleport-agent[0].data.external.join_token: Read complete after 0s [id=-]
module.harbor[0].random_password.admin_password[0]: Refreshing state... [id=none]
module.teleport-agent[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=teleport-agent]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns]
module.teleport-agent[0].kubernetes_cluster_role.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.externaldns[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.cert_manager[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=cert-manager]
module.vault[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=vault]
module.github_runner[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=github]
module.gitlab_runner[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=gitlab]
module.teleport-agent[0].kubernetes_cluster_role.teleport_limited[0]: Refreshing state... [id=teleport-agent-limited]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-viewer]
module.postgres[0].module.ingress.kubernetes_ingress_v1.this[0]: Refreshing state... [id=default/postgres-postgresql-ingress]
module.teleport-agent[0].kubernetes_cluster_role_binding.teleport_agent: Refreshing state... [id=teleport-agent-agent]
module.externaldns[0].kubernetes_deployment.externaldns: Refreshing state... [id=external-dns/external-dns]
module.redis[0].module.ingress.kubernetes_ingress_v1.this[0]: Refreshing state... [id=default/redis-redis-ingress]
module.nats[0].module.ingress.kubernetes_ingress_v1.this[0]: Refreshing state... [id=default/nats-ingress]
module.teleport-agent[0].module.helm.helm_release.this: Refreshing state... [id=teleport-agent]
module.harbor[0].module.credentials.kubernetes_secret.this[0]: Refreshing state... [id=harbor/harbor-credentials]
module.minio[0].module.helm.helm_release.this: Refreshing state... [id=minio]
module.nats[0].module.credentials.kubernetes_secret.this[0]: Refreshing state... [id=default/nats-credentials]
module.redis[0].module.credentials.kubernetes_secret.this[0]: Refreshing state... [id=default/redis-credentials]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.gitlab_runner[0].kubernetes_service_account.gitlab_runner: Refreshing state... [id=gitlab/gitlab-runner-sa]
module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0]: Refreshing state... [id=cert-manager/cloudflare-api-token]
module.cert_manager[0].module.helm.helm_release.this: Refreshing state... [id=cert-manager]
module.github_runner[0].kubernetes_service_account.github_runner: Refreshing state... [id=github/github-runner]
module.postgres[0].module.credentials.kubernetes_secret.this[0]: Refreshing state... [id=default/postgres-credentials]
module.github_runner[0].module.controller_helm.helm_release.this: Refreshing state... [id=gha-runner-scale-set-controller]
module.harbor[0].module.helm.helm_release.this: Refreshing state... [id=harbor]
module.redis[0].module.helm.helm_release.this: Refreshing state... [id=redis]
module.vault[0].module.helm.helm_release.this: Refreshing state... [id=vault]
module.postgres[0].module.helm.helm_release.this: Refreshing state... [id=postgres]
module.nats[0].module.helm.helm_release.this: Refreshing state... [id=nats]
module.postgres[0].data.vault_kv_secret_v2.existing_secret[0]: Reading...
module.postgres[0].data.vault_kv_secret_v2.existing_secret[0]: Read complete after 0s [id=kv/data/cluster-secret-store/secrets/POSTGRES]
module.gitlab_runner[0].module.helm.helm_release.this: Refreshing state... [id=gitlab-runner]
module.postgres[0].vault_kv_secret_v2.postgres_password[0]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/POSTGRES]
module.github_runner[0].module.runner_helm.helm_release.this: Refreshing state... [id=github-runner]
module.external_secrets[0].kubernetes_manifest.vault_secret_store[0]: Refreshing state...
module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.cluster_secrets[0]: Refreshing state...
module.vault[0].vault_auth_backend.kubernetes[0]: Refreshing state... [id=kubernetes]
module.vault[0].vault_mount.kv[0]: Refreshing state... [id=kv]
module.vault[0].vault_kubernetes_auth_backend_config.config[0]: Refreshing state... [id=auth/kubernetes/config]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/PROXMOX_PASSWORD"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/PROXMOX_PASSWORD]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/VAULT_TOKEN"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/VAULT_TOKEN]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/GITLAB_TOKEN"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/GITLAB_TOKEN]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_kubeconfig_path"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/TF_VAR_kubeconfig_path]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/HARBOR_KEY"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/HARBOR_KEY]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/PROXMOX_USERNAME"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/PROXMOX_USERNAME]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/PROXMOX_TOKEN_ID"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/PROXMOX_TOKEN_ID]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/PROXMOX_URL"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/PROXMOX_URL]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/MINIO"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/MINIO]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_pm_api_token_secret"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/TF_VAR_pm_api_token_secret]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/KUBECONFIG"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/KUBECONFIG]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/ISTIO_PRIMARY_CA"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/ISTIO_PRIMARY_CA]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cloudflare"]: Refreshing state... [id=kv/data/cloudflare]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TELEPORT"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/TELEPORT]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/gitlab-runner"]: Refreshing state... [id=kv/data/gitlab-runner]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/github_token"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/github_token]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_pm_api_token_id"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/TF_VAR_pm_api_token_id]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/SOPS"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/SOPS]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/POSTGRES"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/POSTGRES]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secrets"]: Refreshing state... [id=kv/data/cluster-secrets]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/PROXMOX_SECRET"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/PROXMOX_SECRET]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/SSH_PRIVATE_KEY"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/SSH_PRIVATE_KEY]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/github-runner"]: Refreshing state... [id=kv/data/github-runner]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/jenkins"]: Refreshing state... [id=kv/data/jenkins]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/REDIS"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/REDIS]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD]
module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/AWS_ACCESS_KEY_ID"]: Refreshing state... [id=kv/data/cluster-secret-store/secrets/AWS_ACCESS_KEY_ID]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.postgres[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "postgres"
      ~ metadata                   = [
          - {
              - app_version    = "15.4.0"
              - chart          = "postgresql"
              - first_deployed = 1742281969
              - last_deployed  = 1758092371
              - name           = "postgres"
              - namespace      = "default"
              - notes          = <<-EOT
                    CHART NAME: postgresql
                    CHART VERSION: 12.12.10
                    APP VERSION: 15.4.0
                    
                    ** Please be patient while the chart is being deployed **
                    
                    PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                    
                        postgres-postgresql.default.svc.cluster.local - Read/Write connection
                    
                    To get the password for "postgres" run:
                    
                        export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace default postgres-postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                    
                    To get the password for "admin" run:
                    
                        export POSTGRES_PASSWORD=$(kubectl get secret --namespace default postgres-postgresql -o jsonpath="{.data.password}" | base64 -d)
                    
                    To connect to your database run the following command:
                    
                        kubectl run postgres-postgresql-client --rm --tty -i --restart='Never' --namespace default --image registry.fullstack.pw/library/postgres:latest --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                          --command -- psql --host postgres-postgresql -U admin -d postgres -p 5432
                    
                        > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                      NOTE: It may take a few minutes for the LoadBalancer IP to be available.
                            Watch the status with: 'kubectl get svc --namespace default -w postgres-postgresql'
                    
                        export SERVICE_IP=$(kubectl get svc --namespace default postgres-postgresql --template "{{ range (index .status.loadBalancer.ingress 0) }}{{ . }}{{ end }}")
                        PGPASSWORD="$POSTGRES_PASSWORD" psql --host $SERVICE_IP --port 5432 -U admin -d postgres
                    
                    WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                EOT
              - revision       = 61
              - values         = jsonencode(
                    {
                      - architecture = "standalone"
                      - global       = {
                          - postgresql = {
                              - auth = {
                                  - database         = "postgres"
                                  - existingSecret   = ""
                                  - password         = "AvWyu5PeLmec5LUn"
                                  - postgresPassword = "AvWyu5PeLmec5LUn"
                                  - username         = "admin"
                                }
                            }
                        }
                      - image        = {
                          - registry   = "registry.fullstack.pw"
                          - repository = "library/postgres"
                          - tag        = "latest"
                        }
                      - metrics      = {
                          - enabled        = false
                          - serviceMonitor = {
                              - enabled = false
                            }
                        }
                      - postgresql   = {
                          - extraEnvVars = [
                              - {
                                  - name  = "POSTGRESQL_EXTRA_FLAGS"
                                  - value = "-c shared_preload_libraries=vectors.so -c listen_addresses=* -c max_connections=200"
                                },
                            ]
                        }
                      - primary      = {
                          - extraEnvVars = [
                              - {
                                  - name  = "ALLOW_EMPTY_PASSWORD"
                                  - value = "no"
                                },
                              - {
                                  - name  = "POSTGRESQL_CLIENT_MIN_MESSAGES"
                                  - value = "error"
                                },
                              - {
                                  - name  = "POSTGRESQL_SKIP_INITDB"
                                  - value = "false"
                                },
                              - {
                                  - name  = "POSTGRESQL_WAL_LEVEL"
                                  - value = "logical"
                                },
                            ]
                          - persistence  = {
                              - enabled      = true
                              - size         = "10Gi"
                              - storageClass = "local-path"
                            }
                          - resources    = {
                              - limits   = {
                                  - cpu    = "5000m"
                                  - memory = "2048Mi"
                                }
                              - requests = {
                                  - cpu    = "250m"
                                  - memory = "256Mi"
                                }
                            }
                          - service      = {
                              - port = 5432
                              - type = "LoadBalancer"
                            }
                        }
                    }
                )
              - version        = "12.12.10"
            },
        ] -> (known after apply)
        name                       = "postgres"
      ~ values                     = [
          ~ (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

  # module.teleport-agent[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "teleport-agent"
      ~ metadata                   = [
          - {
              - app_version    = "17.7.1"
              - chart          = "teleport-kube-agent"
              - first_deployed = 1755413446
              - last_deployed  = 1758089959
              - name           = "teleport-agent"
              - namespace      = "teleport-agent"
              - notes          = <<-EOT
                    
                EOT
              - revision       = 20
              - values         = jsonencode(
                    {
                      - annotations         = {
                          - cluster = "tools"
                        }
                      - apps                = [
                          - {
                              - name = "harbor"
                              - uri  = "http://harbor-portal.harbor.svc.cluster.local"
                            },
                          - {
                              - name = "minio"
                              - uri  = "http://minio-console.default.svc.cluster.local:9001"
                            },
                          - {
                              - name = "vault"
                              - uri  = "http://vault.vault.svc.cluster.local:8200"
                            },
                        ]
                      - authToken           = "76756646e90d1f740646aa5e30fdd216"
                      - databases           = [
                          - {
                              - name     = "postgres"
                              - protocol = "postgres"
                              - uri      = "postgres.fullstack.pw:5432"
                            },
                        ]
                      - db_service          = {
                          - enabled   = true
                          - resources = [
                              - {
                                  - labels = {
                                      - "*" = "*"
                                    }
                                },
                            ]
                        }
                      - enterprise          = false
                      - kubeClusterName     = "tools"
                      - labels              = {
                          - cluster   = "tools"
                          - component = "teleport-agent"
                        }
                      - proxyAddr           = "teleport.fullstack.pw:3080"
                      - roles               = "kube,app,db"
                      - teleportClusterName = "fullstack-pw"
                    }
                )
              - version        = "17.7.1"
            },
        ] -> (known after apply)
        name                       = "teleport-agent"
      ~ values                     = [
          ~ (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tools.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tools.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.postgres[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "postgres"
      ~ metadata                   = [
          - {
              - app_version    = "15.4.0"
              - chart          = "postgresql"
              - first_deployed = 1742281969
              - last_deployed  = 1758092371
              - name           = "postgres"
              - namespace      = "default"
              - notes          = <<-EOT
                    CHART NAME: postgresql
                    CHART VERSION: 12.12.10
                    APP VERSION: 15.4.0
                    
                    ** Please be patient while the chart is being deployed **
                    
                    PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                    
                        postgres-postgresql.default.svc.cluster.local - Read/Write connection
                    
                    To get the password for "postgres" run:
                    
                        export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace default postgres-postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                    
                    To get the password for "admin" run:
                    
                        export POSTGRES_PASSWORD=$(kubectl get secret --namespace default postgres-postgresql -o jsonpath="{.data.password}" | base64 -d)
                    
                    To connect to your database run the following command:
                    
                        kubectl run postgres-postgresql-client --rm --tty -i --restart='Never' --namespace default --image registry.fullstack.pw/library/postgres:latest --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                          --command -- psql --host postgres-postgresql -U admin -d postgres -p 5432
                    
                        > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                      NOTE: It may take a few minutes for the LoadBalancer IP to be available.
                            Watch the status with: 'kubectl get svc --namespace default -w postgres-postgresql'
                    
                        export SERVICE_IP=$(kubectl get svc --namespace default postgres-postgresql --template "{{ range (index .status.loadBalancer.ingress 0) }}{{ . }}{{ end }}")
                        PGPASSWORD="$POSTGRES_PASSWORD" psql --host $SERVICE_IP --port 5432 -U admin -d postgres
                    
                    WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                EOT
              - revision       = 61
              - values         = jsonencode(
                    {
                      - architecture = "standalone"
                      - global       = {
                          - postgresql = {
                              - auth = {
                                  - database         = "postgres"
                                  - existingSecret   = ""
                                  - password         = "AvWyu5PeLmec5LUn"
                                  - postgresPassword = "AvWyu5PeLmec5LUn"
                                  - username         = "admin"
                                }
                            }
                        }
                      - image        = {
                          - registry   = "registry.fullstack.pw"
                          - repository = "library/postgres"
                          - tag        = "latest"
                        }
                      - metrics      = {
                          - enabled        = false
                          - serviceMonitor = {
                              - enabled = false
                            }
                        }
                      - postgresql   = {
                          - extraEnvVars = [
                              - {
                                  - name  = "POSTGRESQL_EXTRA_FLAGS"
                                  - value = "-c shared_preload_libraries=vectors.so -c listen_addresses=* -c max_connections=200"
                                },
                            ]
                        }
                      - primary      = {
                          - extraEnvVars = [
                              - {
                                  - name  = "ALLOW_EMPTY_PASSWORD"
                                  - value = "no"
                                },
                              - {
                                  - name  = "POSTGRESQL_CLIENT_MIN_MESSAGES"
                                  - value = "error"
                                },
                              - {
                                  - name  = "POSTGRESQL_SKIP_INITDB"
                                  - value = "false"
                                },
                              - {
                                  - name  = "POSTGRESQL_WAL_LEVEL"
                                  - value = "logical"
                                },
                            ]
                          - persistence  = {
                              - enabled      = true
                              - size         = "10Gi"
                              - storageClass = "local-path"
                            }
                          - resources    = {
                              - limits   = {
                                  - cpu    = "5000m"
                                  - memory = "2048Mi"
                                }
                              - requests = {
                                  - cpu    = "250m"
                                  - memory = "256Mi"
                                }
                            }
                          - service      = {
                              - port = 5432
                              - type = "LoadBalancer"
                            }
                        }
                    }
                )
              - version        = "12.12.10"
            },
        ] -> (known after apply)
        name                       = "postgres"
      ~ values                     = [
          ~ (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

  # module.teleport-agent[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "teleport-agent"
      ~ metadata                   = [
          - {
              - app_version    = "17.7.1"
              - chart          = "teleport-kube-agent"
              - first_deployed = 1755413446
              - last_deployed  = 1758089959
              - name           = "teleport-agent"
              - namespace      = "teleport-agent"
              - notes          = <<-EOT
                    
                EOT
              - revision       = 20
              - values         = jsonencode(
                    {
                      - annotations         = {
                          - cluster = "tools"
                        }
                      - apps                = [
                          - {
                              - name = "harbor"
                              - uri  = "http://harbor-portal.harbor.svc.cluster.local"
                            },
                          - {
                              - name = "minio"
                              - uri  = "http://minio-console.default.svc.cluster.local:9001"
                            },
                          - {
                              - name = "vault"
                              - uri  = "http://vault.vault.svc.cluster.local:8200"
                            },
                        ]
                      - authToken           = "76756646e90d1f740646aa5e30fdd216"
                      - databases           = [
                          - {
                              - name     = "postgres"
                              - protocol = "postgres"
                              - uri      = "postgres.fullstack.pw:5432"
                            },
                        ]
                      - db_service          = {
                          - enabled   = true
                          - resources = [
                              - {
                                  - labels = {
                                      - "*" = "*"
                                    }
                                },
                            ]
                        }
                      - enterprise          = false
                      - kubeClusterName     = "tools"
                      - labels              = {
                          - cluster   = "tools"
                          - component = "teleport-agent"
                        }
                      - proxyAddr           = "teleport.fullstack.pw:3080"
                      - roles               = "kube,app,db"
                      - teleportClusterName = "fullstack-pw"
                    }
                )
              - version        = "17.7.1"
            },
        ] -> (known after apply)
        name                       = "teleport-agent"
      ~ values                     = [
          ~ (sensitive value),
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

#########################################################
##
##   Planning changes for cluster-api environment...
##
#########################################################
module.externaldns[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns]
module.cert_manager[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=cert-manager]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-viewer]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.externaldns[0].kubernetes_deployment.externaldns: Refreshing state... [id=external-dns/external-dns]
module.cert_manager[0].module.cloudflare_secret.kubernetes_secret.this[0]: Refreshing state... [id=cert-manager/cloudflare-api-token]
module.cert_manager[0].module.helm.helm_release.this: Refreshing state... [id=cert-manager]
module.external_secrets[0].kubernetes_manifest.vault_secret_store[0]: Refreshing state...
module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0]: Refreshing state...
module.external_secrets[0].kubernetes_manifest.cluster_secrets[0]: Refreshing state...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for homologate-cluster-api environment...
##
#########################################################
module.externaldns[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-dns]
module.external_secrets[0].module.namespace.kubernetes_namespace.this[0]: Refreshing state... [id=external-secrets]
module.externaldns[0].kubernetes_service_account.externaldns: Refreshing state... [id=external-dns/external-dns]
module.externaldns[0].kubernetes_cluster_role.externaldns: Refreshing state... [id=external-dns]
module.externaldns[0].kubernetes_deployment.externaldns: Refreshing state... [id=external-dns/external-dns]
module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0]: Refreshing state... [id=external-secrets/vault-token]
module.external_secrets[0].module.helm.helm_release.this: Refreshing state... [id=external-secrets]
module.externaldns[0].kubernetes_cluster_role_binding.externaldns: Refreshing state... [id=external-dns-viewer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cert_manager[0].kubernetes_manifest.letsencrypt_issuer[0] will be created
  + resource "kubernetes_manifest" "letsencrypt_issuer" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-prod"
            }
          + spec       = {
              + acme = {
                  + email               = "pedropilla@gmail.com"
                  + privateKeySecretRef = {
                      + name = "letsencrypt-prod"
                    }
                  + server              = "https://acme-v02.api.letsencrypt.org/directory"
                  + solvers             = [
                      + {
                          + dns01 = {
                              + cloudflare = {
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token"
                                    }
                                  + email             = "pedropilla@gmail.com"
                                }
                            }
                        },
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "letsencrypt-prod"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + acme       = {
                  + caBundle                    = (known after apply)
                  + disableAccountKeyGeneration = (known after apply)
                  + email                       = "pedropilla@gmail.com"
                  + enableDurationFeature       = (known after apply)
                  + externalAccountBinding      = {
                      + keyAlgorithm = (known after apply)
                      + keyID        = (known after apply)
                      + keySecretRef = {
                          + key  = (known after apply)
                          + name = (known after apply)
                        }
                    }
                  + preferredChain              = (known after apply)
                  + privateKeySecretRef         = {
                      + key  = (known after apply)
                      + name = "letsencrypt-prod"
                    }
                  + profile                     = (known after apply)
                  + server                      = "https://acme-v02.api.letsencrypt.org/directory"
                  + skipTLSVerify               = (known after apply)
                  + solvers                     = [
                      + {
                          + dns01    = {
                              + acmeDNS       = {
                                  + accountSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + host             = (known after apply)
                                }
                              + akamai        = {
                                  + accessTokenSecretRef  = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + clientSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + clientTokenSecretRef  = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + serviceConsumerDomain = (known after apply)
                                }
                              + azureDNS      = {
                                  + clientID              = (known after apply)
                                  + clientSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + environment           = (known after apply)
                                  + hostedZoneName        = (known after apply)
                                  + managedIdentity       = {
                                      + clientID   = (known after apply)
                                      + resourceID = (known after apply)
                                      + tenantID   = (known after apply)
                                    }
                                  + resourceGroupName     = (known after apply)
                                  + subscriptionID        = (known after apply)
                                  + tenantID              = (known after apply)
                                }
                              + cloudDNS      = {
                                  + hostedZoneName          = (known after apply)
                                  + project                 = (known after apply)
                                  + serviceAccountSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + cloudflare    = {
                                  + apiKeySecretRef   = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token"
                                    }
                                  + email             = "pedropilla@gmail.com"
                                }
                              + cnameStrategy = (known after apply)
                              + digitalocean  = {
                                  + tokenSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + rfc2136       = {
                                  + nameserver          = (known after apply)
                                  + tsigAlgorithm       = (known after apply)
                                  + tsigKeyName         = (known after apply)
                                  + tsigSecretSecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + route53       = {
                                  + accessKeyID              = (known after apply)
                                  + accessKeyIDSecretRef     = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                  + auth                     = {
                                      + kubernetes = {
                                          + serviceAccountRef = {
                                              + audiences = (known after apply)
                                              + name      = (known after apply)
                                            }
                                        }
                                    }
                                  + hostedZoneID             = (known after apply)
                                  + region                   = (known after apply)
                                  + role                     = (known after apply)
                                  + secretAccessKeySecretRef = {
                                      + key  = (known after apply)
                                      + name = (known after apply)
                                    }
                                }
                              + webhook       = {
                                  + config     = (known after apply)
                                  + groupName  = (known after apply)
                                  + solverName = (known after apply)
                                }
                            }
                          + http01   = {
                              + gatewayHTTPRoute = {
                                  + labels      = (known after apply)
                                  + parentRefs  = (known after apply)
                                  + podTemplate = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                      + spec     = {
                                          + affinity           = {
                                              + nodeAffinity    = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      + nodeSelectorTerms = (known after apply)
                                                    }
                                                }
                                              + podAffinity     = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                              + podAntiAffinity = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                            }
                                          + imagePullSecrets   = (known after apply)
                                          + nodeSelector       = (known after apply)
                                          + priorityClassName  = (known after apply)
                                          + securityContext    = {
                                              + fsGroup             = (known after apply)
                                              + fsGroupChangePolicy = (known after apply)
                                              + runAsGroup          = (known after apply)
                                              + runAsNonRoot        = (known after apply)
                                              + runAsUser           = (known after apply)
                                              + seLinuxOptions      = {
                                                  + level = (known after apply)
                                                  + role  = (known after apply)
                                                  + type  = (known after apply)
                                                  + user  = (known after apply)
                                                }
                                              + seccompProfile      = {
                                                  + localhostProfile = (known after apply)
                                                  + type             = (known after apply)
                                                }
                                              + supplementalGroups  = (known after apply)
                                              + sysctls             = (known after apply)
                                            }
                                          + serviceAccountName = (known after apply)
                                          + tolerations        = (known after apply)
                                        }
                                    }
                                  + serviceType = (known after apply)
                                }
                              + ingress          = {
                                  + class            = (known after apply)
                                  + ingressClassName = (known after apply)
                                  + ingressTemplate  = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                    }
                                  + name             = (known after apply)
                                  + podTemplate      = {
                                      + metadata = {
                                          + annotations = (known after apply)
                                          + labels      = (known after apply)
                                        }
                                      + spec     = {
                                          + affinity           = {
                                              + nodeAffinity    = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                                      + nodeSelectorTerms = (known after apply)
                                                    }
                                                }
                                              + podAffinity     = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                              + podAntiAffinity = {
                                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                                }
                                            }
                                          + imagePullSecrets   = (known after apply)
                                          + nodeSelector       = (known after apply)
                                          + priorityClassName  = (known after apply)
                                          + securityContext    = {
                                              + fsGroup             = (known after apply)
                                              + fsGroupChangePolicy = (known after apply)
                                              + runAsGroup          = (known after apply)
                                              + runAsNonRoot        = (known after apply)
                                              + runAsUser           = (known after apply)
                                              + seLinuxOpt

... Output truncated due to size. See artifacts for full plan.
  ```
  
  Plan exit code: 0
  